templates/google_it/log/20160210-1543/config.xml
<?xml version="1.0"?><tsung loglevel="notice">
<clients>
<client host="localhost" use_controller_vm="true"/>
</clients>
<servers>
<server host="cnn.com" port="80" type="tcp"/>
</servers>
<load loop="2">
<arrivalphase phase="1" duration="1" unit="minute">
<users maxnumber="100" interarrival="4" unit="second"/>
</arrivalphase>
<arrivalphase phase="2" duration="2" unit="minute">
<users maxnumber="100" interarrival="1" unit="second"/>
</arrivalphase>
<arrivalphase phase="3" duration="2" unit="minute">
<users maxnumber="100" arrivalrate="10" unit="second"/>
</arrivalphase>
</load>
<options>
<option name="user_agent" type="ts_http">
<user_agent probability="30">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
<user_agent probability="30">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
<user_agent probability="40">Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.103 Safari/537.36</user_agent>
</option>
</options>
<sessions>
<session name="http-example" probability="100" type="ts_http">
<request>
<http url="/" method="GET" version="1.1" contents=""/>
</request>
</session>
</sessions>
</tsung>